{
  "title": "Big Bamboo Household Standing Plant Pot  Perfect for Home  Garden",
  "ratings": "66+ ratings",
  "note": "Selling fast! 10 people have this in their carts.",
  "price": "Rs.2,300.00 PKR",
  "originalPrice": "Rs.2,700.00 PKR",
  "discount": "15% OFF",
  "deliveryEstimate": "Order in the next 23 hour(s) 54 minute(s) to get it between [26_March] and [29_March]",
  "images": [
    "/images/big-red.png",
    "/images/big-yellow.png",
    "/images/big-white.png"
  ],
  "variants": [
    {
      "color": "Red",
      "image": "/images/big-red.png"
    },
    {
      "color": "Yellow",
      "image": "/images/big-yellow.png"
    },
    {
      "color": "Deep half white hint natural",
      "image": "/images/big-white.png"
    }
  ],
  "description": "This beautiful Big Bamboo Pot is perfect for both indoor and outdoor settings. Handcrafted for elegance and durability.",
  "specification": "Material: Natural Bamboo\nHeight: 20 inches\nWeight: 1.2 kg\nUsage: Indoor & Outdoor",
  "warrantySupport": "6-month warranty included. For support, contact us via email or WhatsApp. We are always happy to help.",
  "steps": [
    {
      "title": "Step 1: Preparing the Materials  Bamboo and Wooden Elements",
      "description": "Elevate your walls with eco-friendly bamboo hanging art. Perfect for homes, kitchens, bedrooms, guest areas, and offices, its natural texture brings calm and rustic elegance to any setting. Ideal for kitchen wall decor, home goods wall decor, and exterior wall art, it blends beautifully with every theme. Handcrafted with care, it’s a sustainable choice for modern interiors. Order today and transform your walls with nature’s charm.",
      "image": "/images/b-step1.png"
    },
    {
      "title": "Step 2: Customizing the Hanging Wall Decor",
      "description": "Begin customizing your bamboo wall by placing the first leaf stick into the front top hole. Hold it gently and press it in. This is the first step toward a natural, handmade design. It sets the tone for a rustic and earthy wall style. Ideal for bedroom wall decor, big wall decor, and unique wall hanging looks. A small step that begins a big transformation.",
      "image": "/images/b-step2.png"
    },
    {
      "title": "Step 3: Balance Your Wall Art",
      "description": "Insert the second bamboo leaf stick into the remaining front hole. Gently push it until balanced with the first. Now your bamboo piece looks complete and symmetrical. Ideal for guest room wall decor, huge wall art, and cozy living room art. This step finishes the design with harmony and handcrafted elegance.",
      "image": "/images/b-step3.png"
    },
    {
      "title": "Step 4: Ready to Hang, Ready to Inspire",
      "description": "Now that your bamboo wall decor is customized, it's ready to hang. Use the back hole to mount it with a hook or nail. Great for wall art for bedroom, interior bamboo decoration, and adding a natural feel to modern spaces. It brings a peaceful, eco-conscious look to any wall in your home, office, or guest room.",
      "image": "/images/b-step4.png"
    }
  ]
}
